CFD_results/14.3mm-split-3out/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
79587
(
(-0.0134476575175009 0.0693305918551693 1.04441173283353)
(-0.100694793457426 0.0708886995778194 1.0454827168355)
(0.00999449860953777 0.0253346650365987 1.04917682889667)
(-0.0131449710108324 -0.00757274300110466 1.08357863573684)
(0.0103235952115413 -0.00949367463108014 1.06882270543441)
(0.0234605497047706 -0.0176828663607953 1.0640933678024)
(0.0426033239918421 0.00355185248815868 1.04690353487826)
(0.0380803311467569 -0.021134770717963 1.07525872838347)
...
)
;

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 3e-05;
        extrapolateProfile false;
        value           nonuniform List<vector> 
142
(
(-1.17503562452338e-12 2.70621426441602e-12 1.06791553319638)
(-2.06317105536691e-13 1.75301746784428e-12 1.06791553319638)
(1.21155080302238e-12 1.46252409735358e-12 1.06791553319638)
(5.0218975075962e-13 2.31926422952761e-12 1.06791553319638)
(1.47038467641326e-13 1.62237843362919e-12 1.06791553319638)
(7.26848159722483e-13 8.43610309149716e-13 1.06791553319638)
(-8.16137188003862e-13 3.28107748799012e-12 1.06791553319638)
(6.45357656182532e-13 1.50624981746377e-12 1.06791553319638)
...
)
;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
402
(
(-0.175711624012314 -0.0983830294043625 -0.431650316228947)
(-0.169638956585621 -0.0913515815067832 -0.440773318781435)
(-0.173258046096405 -0.107843684692243 -0.410118017656777)
(-0.182525360616293 -0.101355211735325 -0.422759886567853)
(-0.192565154481062 -0.14217542387499 -0.436354269338695)
(-0.208685629498041 -0.172904830052122 -0.45672633656441)
(-0.146812296057465 -0.139597173670363 -0.412406359782228)
(-0.149737467060814 -0.122475062321714 -0.40294796681763)
...
)
;
    }
    wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
