CFD_results/14.3mm-split-3out/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
226198
(
1.53818421057617e-07
-3.55194575681429e-10
-1.85611009088911e-08
-2.55044469210523e-08
-1.36353798352697e-07
2.6956005324682e-08
-1.23451402267788e-07
-1.07853402206011e-07
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
142
(
-8.11120604753097e-08
-6.66068400843882e-08
-6.8775940407743e-08
-3.96911003449301e-08
-2.42736594129656e-07
-3.03969702326128e-07
-6.38397725088432e-08
-7.85041555790528e-08
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
402
(
3.02302552460918e-08
3.51842149288214e-08
8.23920204390625e-08
9.89305163666474e-08
2.14154070244511e-08
1.85675117608935e-08
5.77123496415723e-08
9.24611870945141e-08
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
